
&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекстКомментария = Комментарий;
	//Сообщить (ТекстКомментария);
	МассивПодстрок = СтрРазделить(ТекстКомментария, " ");
	Счетчик = 0;
	Для Каждого Подстрока Из МассивПодстрок Цикл
		  Позиция = Найти(Подстрока, "e1cib/");
		  Если Позиция > 0 Тогда
		  	НомерЭлементаССсылкой = Счетчик;
		  КонецЕсли;
		  Счетчик=Счетчик+1;
	КонецЦикла;
	НавигационнаяСсылка = МассивПодстрок[НомерЭлементаССсылкой];
	ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка);
КонецПроцедуры


&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	Для Каждого ТекСтрокаТовары Из Объект.Товары Цикл
		 ТекСтрокаТовары.Сумма = ТекСтрокаТовары.Количество * ТекСтрокаТовары.Цена;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Для Каждого ТекСтрокаТовары Из Объект.Товары Цикл
		 ТекСтрокаТовары.Сумма = ТекСтрокаТовары.Количество * ТекСтрокаТовары.Цена;
	КонецЦикла;
КонецПроцедуры

