
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОстаткиТоваров Расход
		
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		Если ТекСтрокаТовары.Номенклатура.ЭтоУслуга = Истина  Тогда
			Продолжить;
		КонецЕсли;
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
		
	КонецЦикла;
	
	Движения.Записать();
	
	Если Режим = РежимПроведенияДокумента.Оперативный  Тогда 
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОстаткиТоваровОстатки.Склад КАК Склад,
			|	ОстаткиТоваровОстатки.Номенклатура КАК Номенклатура,
			|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.ОстаткиТоваров.Остатки(
			|			,
			|			Склад В
			|				(ВЫБРАТЬ
			|					РасходнаяНакладная.Склад КАК Склад
			|				ИЗ
			|					Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|				ГДЕ
			|					РасходнаяНакладная.Ссылка = &Ссылка)) КАК ОстаткиТоваровОстатки
			|ГДЕ
			|	ОстаткиТоваровОстатки.КоличествоОстаток < 0";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда 
			
			Отказ = Истина;
		
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "По номенклатуре " + ВыборкаДетальныеЗаписи.Номенклатура + " образовался отрицательный остаток: " + ВыборкаДетальныеЗаписи.КоличествоОстаток;
				//Сообщение.Поле =  "Товары["+ (ВыборкаДетальныеЗаписи.НомерСтроки-1) +"].Количество";
				//Сообщение.Поле =  "Объект.Товары[0].Количество";
			//	Сообщение.Поле = Товары[ВыборкаДетальныеЗаписи.НомерСтроки-1].Количество;
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();         
			КонецЦикла;
		
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
